/* Напишите программу, которая на вход принимает два числа и выдаёт, 
какое число большее, а какое меньшее.*/

/*Console.Write("Введите число а= ");
int a = Console.Read();

Console.Write("Введите число b= ");
int b = Console.Read();
*/
// Почему-то при запуске кода блока, который выше, я ввожу первое число, и после нажатия на Enter программа не предлагает
//ввести вторе число, а сразу переходит к выводу. Вопрос почему так?

int a = 15;
int b = 12;

if (a>b)
{
	Console.WriteLine($"Наибольшее= {a}");
}
else
{
	Console.WriteLine($"Наибольшее= {b}");
}