/* Напишите программу, которая на вход принимает два числа и выдаёт, 
какое число большее, а какое меньшее.*/

Console.WriteLine("Введите число а= ");
int a = Console.Read();

Console.WriteLine("Введите число b= ");
int b = Console.Read();

if (a>b);
{
	Console.WriteLine($"Наибольшее=  {a}");
	Console.WriteLine($"Наименьшее=  {b}");
}