CREATE TABLE List
(
  Fio TEXT, 
  Birthday VARCHAR(45), 
  Status TEXT,
  Phone INT, 
  Comment VARCHAR(30), 
  Adress TEXT, 
  Groupping  VARCHAR(30)
);

INSERT INTO List (Fio,Birthday,Status,Phone,Comment,Adress,Groupping)
VALUES
  ("Иванов И. И.","1990-12-02","женат", 126,"интернет","Можга","Работа"),
  ("Иванов И. И.","1990-02-12","женат",127,"старый","Можга","Работа"),
  ("Иванов И. И.","2001-09-18","холост",527,"личный","Санкт-Петербург","Школа"),
  ("Петров П. П.","1983-04-23","женат",234,"личный","Москва","Родня"),
  ("Петров П. П.","1983-04-24","женат",235,"рабочий","Москва","Родня"),
  ("Васильев В. В.","1998-05-21","холост",456,"личный","Белгород","Друзья"),
  ("Сидоров С.С.","2007-07-13","холост",643,"личный","Киров","Родня"),
  ("Сидоров С.С.","2007-07-13","холост",654,"старый","Киров","Родня"),
  ("Александров А.А.","1987-03-05","женат",412,"рабочий","Уфа","Друзья"),
  ("Борисов Б.Б","1989-08-16","холост",723,"рабочий","Москва","Работа"),
  ("Михайлов М.М.","1997-01-08","женат",876,"личный","Сочи","Университет"),
  ("Михайлов М.М.","1997-01-08","женат",875,"рабочий","Сочи","Университет"),
  ("Кириллов К.К.","1996-12-03","холост",933,"личный","Киров","Работа");

select * from List;

SELECT "Result";
-- 1.SELECT ФИО, Д/р, Адрес FROM Общий список
SELECT Fio, Birthday, Adress
FROM List;

SELECT "Result";
-- 2.SELECT ФИО, Статус FROM Общий список WHERE Адрес = «Можга»
SELECT Fio, Status
FROM List
WHERE Adress = "Можга";

SELECT "Result";
-- 3.SELECT ФИО FROM Общий список WHERE Адрес = «Москва» AND Группа = «Работа»
SELECT Fio
FROM List
WHERE Adress = "Москва" AND Groupping = "Работа";

SELECT "Result";
-- SELECT Д/р FROM Общий список WHERE Адрес = «Москва» OR Группа = «Работа»
SELECT Birthday
FROM List
WHERE Adress = "Москва" OR Groupping = "Работа";